ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
/**
  **************************************************************************
  * @file     cf.c
  * @brief    xmc pc card program
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "cf.h"
#include "at32f403.h"
#include "at32f403_board.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/** @addtogroup AT32F403_periph_examples
  * @{
  */

/** @addtogroup XMC_CF_CARD
  * @{
  */

u16 DMA1_MEM_LEN;

#define PCCARD_TIMEOUT_READ_ID      (uint32_t)0x0000FFFF
#define PCCARD_TIMEOUT_SECTOR       (uint32_t)0x0000FFFF
#define PCCARD_TIMEOUT_STATUS       (uint32_t)0x01000000

#define PCCARD_status_ok            (uint8_t)0x58
#define PCCARD_STATUS_WRITE_OK      (uint8_t)0x50

/**
* @brief  dma configuration
* @param  edma_chx: pointer to a edma_channel_type structure
* @param  cpar_src: the memory 1 addr
* @param  cmar_dst: the memory 2 addr
* @param  cndtr: transfer size
* @param  transfer_type: 
*     @arg read_transfer: from memory 1 to memory 2
*     @arg write_transfer: from memory 2 to memory 1
* @param  transfer_width: byte or halfword
* @retval none
*/
void MYDMA_Config(dma_channel_type* dmay_channelx, uint32_t cpar_src, uint32_t cmar_dst, uint32_t cndtr, uint8_t Transfer_Type, uint8_t Transfer_Width)
{
  dma_init_type  dma_initstruct;
  crm_periph_clock_enable(CRM_DMA1_PERIPH_CLOCK, TRUE);

  dma_reset(dmay_channelx);

  if(Transfer_Type == READ_TRANSFER)
  {
    dma_initstruct.peripheral_inc_enable = FALSE;
    dma_initstruct.memory_inc_enable = TRUE;
  }
  else
  {
    dma_initstruct.peripheral_inc_enable = TRUE;
    dma_initstruct.memory_inc_enable = FALSE;
  }

  if(Transfer_Width == ENABLE_8_BIT_TRANSFER)
  {
    dma_initstruct.peripheral_data_width = DMA_PERIPHERAL_DATA_WIDTH_BYTE;
    dma_initstruct.memory_data_width = DMA_MEMORY_DATA_WIDTH_BYTE;
  }
  else
  {
    dma_initstruct.peripheral_data_width = DMA_PERIPHERAL_DATA_WIDTH_HALFWORD;
    dma_initstruct.memory_data_width = DMA_MEMORY_DATA_WIDTH_HALFWORD;
  }

  dma_initstruct.direction = DMA_DIR_MEMORY_TO_MEMORY;
  dma_initstruct.buffer_size = cndtr;
  dma_initstruct.peripheral_base_addr = cpar_src;

  dma_initstruct.memory_base_addr = cmar_dst;

  dma_initstruct.loop_mode_enable = FALSE;
  dma_initstruct.priority = DMA_PRIORITY_MEDIUM;
  dma_init(dmay_channelx,&dma_initstruct);
 
  
  dma_channel_enable(dmay_channelx, TRUE);
}

/**
  * @brief  xmc init ctrl
  * @param  device: pointer to a xmc_bank4_type structure
  * @param  init: pointer to a xmc_pccardinittype structure
  * @param  set_reg_8_bit: choose 8/16bit
  * @retval status_ok or status_error
  */
status_type xmc_pccard_init_ctrl(xmc_bank4_type *Device, xmc_pccard_init_type *init, uint8_t Set_reg_8_bit)
{
  if(Set_reg_8_bit == 1)
  {
   Device->bk4ctrl_bit.extmdbw = 0x0;
  }
  else
  {
   Device->bk4ctrl_bit.extmdbw = 0x1;
  }
   
  Device->bk4ctrl_bit.tar = init->delay_time_ar;
  Device->bk4ctrl_bit.tcr = init->delay_time_cr;

  return status_ok;

}

/**
  * @brief  xmc enable wait feature
  * @param  device: pointer to a xmc_bank4_type structure
  * @param  init: pointer to a xmc_pccardinittype structure
  * @retval status_ok or status_error
  */
status_type xmc_enable_wait_feature(xmc_bank4_type *Device, xmc_pccard_init_type *init)
{
 
 Device->bk4ctrl_bit.nwen = init->enable_wait;

  return status_ok;
}

/**
  * @brief  set 16bit_feature
  * @param  device: pointer to a xmc_bank4_type structure
  * @param  init: pointer to a xmc_pccardinittype structure
  * @param  set_reg_8_bit: choose 8/16bit
  * @retval status
  */
status_type xmc_enable_16bit_feature(xmc_bank4_type *Device, xmc_pccard_init_type *init, uint8_t Set_reg_8_bit)
{
  if(Set_reg_8_bit == 1)
  {
   Device->bk4ctrl_bit.extmdbw = 0x0;
  }
  else
  {
   Device->bk4ctrl_bit.extmdbw = 0x1;
  }

  return status_ok;
}

/**
  * @brief  init commonspace timing
  * @param  device: pointer to a xmc_bank4_type structure
  * @param  timing: pointer to a common space timing structure
  * @retval status
  */
status_type xmc_pccard_init_common_space_timing(xmc_bank4_type *Device, xmc_nand_pccard_timinginit_type *Timing)
{
 Device->bk4tmgmem_bit.cmdhizt = Timing->mem_hiz_time;
 Device->bk4tmgmem_bit.cmht = Timing->mem_hold_time;
 Device->bk4tmgmem_bit.cmst = Timing->mem_setup_time;
 Device->bk4tmgmem_bit.cmwt = Timing->mem_waite_time;

  return status_ok;
}

/**
  * @brief  init attributespace timing
  * @param  device: pointer to a xmc_bank4_type structure
  * @param  timing: pointer to a attribute space timing structure
  * @retval status
  */
status_type xmc_pccard_init_attribute_space_timing(xmc_bank4_type *Device, xmc_nand_pccard_timinginit_type *Timing)
{
  Device->bk4tmgatt_bit.amdhizt = Timing->mem_hiz_time;
  Device->bk4tmgatt_bit.amht = Timing->mem_hold_time;
  Device->bk4tmgatt_bit.amst = Timing->mem_setup_time;
  Device->bk4tmgatt_bit.amwt = Timing->mem_waite_time;
  return status_ok;
}

/**
  * @brief  init iospace timing
  * @param  device: pointer to a xmc_bank4_type structure
  * @param  timing: pointer to a io space timing structure
  * @retval status
  */
status_type xmc_pccard_init_iospace_timing(xmc_bank4_type *Device, xmc_nand_pccard_timinginit_type *Timing)
{
 
