ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  return TRUE;
}

/**
  * @brief  read sector from pccard memory
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to destination read buffer
  * @param  sector_address: sector address to read
  * @retval status
  */
BOOL pccard_read_sector(pccard_handle_type *hpccard, uint8_t *pbuffer, uint32_t sector_address, uint32_t sector_count)
{
  uint16_t Count = 0;
  uint8_t Reg;

  if(sector_count == 0)
  {
    sector_count = 256;
  }

  while(Count < sector_count)
  {

    translate_chsaddr(hpccard, sector_address, Count, sector_count);
    Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = (uint8_t)hpccard->cf.cf_addr.sector_count;
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

    if(cf_send_command(hpccard, ATA_READ_SECTOR_CMD))
    {
      while(1)
      {
        if(task_file_regis_valid(hpccard))
        {
          if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
          {
            pbuffer = read_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);

            sector_address += 1;
            Count += 1;

            if (Count == sector_count)
            {
              break;
            }

            if (Count <= (sector_count / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector)
              if (Count % hpccard->cf.cf_addr.sector_count == 0)
              {
                break;
              }
          }
          else if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
          {
            return FALSE;
          }
        }
      }
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
                    printf("Error Code=%X\n", pccard_read_status_reg(hpccard));
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}

/**
  * @brief  write sector to pccard memory
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to source write buffer
  * @param  sector_address: sector address to write
  * @retval status
  */
BOOL pccard_write_sector(pccard_handle_type *hpccard, uint8_t *pbuffer, uint32_t sector_address, uint32_t sector_count)
{
  uint16_t Count = 0;
  uint8_t Reg;

  if(sector_count == 0)
  {
    sector_count = 256;
  }

  while(Count < sector_count)
  {
    // Set the parameters to write a sector //
    translate_chsaddr(hpccard, sector_address, Count, sector_count);
    Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

    //*(__IO uint16_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = hpccard->cf.cf_addr.cylinder;
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = (uint8_t)hpccard->cf.cf_addr.sector_count;
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

    if(cf_send_command(hpccard, ATA_WRITE_SECTOR_CMD))
    {
      while(1)
      {
        if(task_file_regis_valid(hpccard))
        {
          if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
          {
            pbuffer = write_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);

            sector_address += 1;
            Count += 1;

            if (Count == sector_count)
            {
              break;
            }

            if (Count <= (sector_count / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector)
              if (Count % hpccard->cf.cf_addr.sector_count == 0)
              {
                break;
              }
          }
          else if (pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
          {
            return FALSE;
          }
        }
      }
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT))
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
                    printf("Error Code=%X\n", pccard_read_status_reg(hpccard));
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}


/**
  * @brief  erase sector from pccard memory
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_address: sector address to erase
  * @retval status
  */
BOOL pccard_erase_sector(pccard_handle_type *hpccard, uint32_t sector_address, uint32_t sector_count)
{
  uint8_t Reg;
  uint16_t Count = 0;

  while (Count < sector_count)
  {

    translate_chsaddr(hpccard, sector_address, 0, sector_count);
    Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

    if(cf_send_command(hpccard, ATA_ERASE_SECTOR_CMD))
    {
      Count += hpccard->cf.cf_addr.sector_count;
      sector_address += hpccard->cf.cf_addr.sector_count;
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT))
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
          return FALSE;
        }
      }
    }
  }

