ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  return TRUE;
}

/**
  * @brief  diagnostic
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_diagnostic(pccard_handle_type *hpccard)
{
  uint8_t ERROR_REG;

  /* Set the parameters */
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_EXECUTE_DRIVE_DIAG_CMD))
  {
    return FALSE;
  }

  ERROR_REG = pccard_read_error_reg(hpccard);

  if((ERROR_REG == 0x01) || (ERROR_REG == 0x02) || (ERROR_REG == 0x03) || (ERROR_REG == 0x04) || (ERROR_REG == 0x05) || (ERROR_REG == 0x80))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  check power mode
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_check_power_mode(pccard_handle_type *hpccard)
{
  uint8_t sector_count_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_CHECK_POWER_MODE_CMD))
  {
    return FALSE;
  }

  sector_count_REG =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count);

  if(sector_count_REG == 0xFF || sector_count_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  set idle 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_count: the sector count 
  * @retval true or false.
  */
BOOL pccard_idle(pccard_handle_type *hpccard, uint32_t sector_count)
{
  uint8_t sector_count_REG;

  hpccard->cf.cf_addr.sector_count = sector_count;

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_IDLE_CMD))
  {
    return FALSE;
  }

  /* check power mode */
  if(!pccard_check_power_mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  sector_count_REG =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count);

  if(sector_count_REG == 0xFF)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  idle immediate 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_idle_immediate(pccard_handle_type *hpccard)
{
  uint8_t sector_count_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_IDLE_IMMEDIATE_CMD))
  {
    return FALSE;
  }

  /* Check Power Mode */
  if(!pccard_check_power_mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  sector_count_REG =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count);

  if(sector_count_REG == 0xFF)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  set sleep mode 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_set_sleep_mode(pccard_handle_type *hpccard)
{
  uint8_t sector_count_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_SET_SLEEP_MODE_CMD))
  {
    return FALSE;
  }

  /* Check Power Mode */
  if(!pccard_check_power_mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  sector_count_REG =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count);

  if(sector_count_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  set standby 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_standby(pccard_handle_type *hpccard)
{
  uint8_t sector_count_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_STANDBY_CMD))
  {
    return FALSE;
  }

  /* check power mode */
  if(!pccard_check_power_mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  sector_count_REG =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count);

  if(sector_count_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  standby immediate 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_standby_immediate(pccard_handle_type *hpccard)
{
  uint8_t sector_count_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_STANDBY_IMMEDIATE_CMD))
  {
    return FALSE;
  }

  /* check power mode */
  if(!pccard_check_power_mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  sector_count_REG =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count);

  if(sector_count_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  reuqest sense the pccard 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_reuqest_sense(pccard_handle_type *hpccard)
{
  uint8_t Reg, ERROR_REG;

  Reg = hpccard->cf.cf_addr.drv | 0xA0;

