ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

  if(!cf_send_command(hpccard, ATA_REQUEST_SENSE_CMD))
  {
    return FALSE;
  }

  ERROR_REG = pccard_read_error_reg(hpccard);

  if((ERROR_REG == 0x2F) || (ERROR_REG == 0x21))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  recalibrate the pccard 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL pccard_recalibrate(pccard_handle_type *hpccard)
{
  uint8_t Reg, ERROR_REG;

  Reg = hpccard->cf.cf_addr.drv | 0xA0;

  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

  if(!cf_send_command(hpccard, ATA_RECALIBRATE_CMD))
  {
    return FALSE;
  }

  ERROR_REG = pccard_read_error_reg(hpccard);

  if((0x00 == ERROR_REG))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  init drive para 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_count: the sector count 
  * @param  head_count: the head count.
  * @retval true or false.
  */
BOOL pccard_init_drive_para(pccard_handle_type *hpccard, uint16_t sector_count, uint8_t head_count)
{
  uint8_t Reg;

  hpccard->cf.cf_addr.head = (uint8_t)head_count;
  hpccard->cf.cf_addr.sector_count = (uint8_t)sector_count;

  Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv;

  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

  if(!cf_send_command(hpccard, ATA_INIT_DRIVE_PARA_CMD))
  {
    return FALSE;
  }

  return TRUE;
}

/**
  * @brief  seek pccard 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  head_count: the head count.
  * @param  cylinder_count: the cylinder count 
  * @retval true or false.
  */
BOOL pccard_seek(pccard_handle_type *hpccard, uint8_t head_count, uint16_t Cylinder_Count)
{
  uint8_t Reg, ERROR_REG;

  hpccard->cf.cf_addr.head = (uint8_t)head_count;
  hpccard->cf.cf_addr.cylinder = (uint16_t)Cylinder_Count;

  Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);

  /* This command should return false */
  if(cf_send_command(hpccard, ATA_SEEK_CMD)) 
  {
    return FALSE;
  }

  ERROR_REG = pccard_read_error_reg(hpccard);

  if((ERROR_REG != 0x00))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  format track 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to the data buffer.
  * @param  sector_address: the sector addr 
  * @param  sector_count: the sector count 
  * @retval true or false.
  */
BOOL pccard_format_track(pccard_handle_type *hpccard, uint8_t *pbuffer, uint32_t sector_address, uint32_t sector_count)
{
  uint16_t Count = 0;
  uint8_t  Reg;

  if(sector_count == 0)
  {
    sector_count = 256;
  }

  while(Count < sector_count)
  {
    /* set the parameters to write a sector */
    translate_chsaddr(hpccard, sector_address, Count, sector_count);
    Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

    if(cf_send_command(hpccard, ATA_FORMAT_TRACK_CMD))
    {
      while(1)
      {
        if(task_file_regis_valid(hpccard))
        {
          if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
          {
           // write_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);

            sector_address += 1;
            Count += 1;

            if (Count == sector_count)
            {
              break;
            }

            if (Count <= (sector_count / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector)
              if (Count % hpccard->cf.cf_addr.sector_count == 0)
              {
                break;
              }
          }
          else if (pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
          {
            return FALSE;
          }
        }
      }
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}

/**
  * @brief  read verify sector
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_address: the sector addr 
  * @param  sector_count: the sector count 
  * @retval true or false.
  */
BOOL pccard_read_verify_sector(pccard_handle_type *hpccard, uint32_t sector_address, uint16_t sector_count)
{
  uint16_t Count = 0;
  uint8_t Reg;

  if(sector_count == 0)
  {
    sector_count = 256;
  }

  while(Count < sector_count)
  {

    translate_chsaddr(hpccard, sector_address, Count, sector_count);
    Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

