ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

    if(cf_send_command(hpccard, ATA_READ_VERIFY_SECTOR_CMD))
    {
      while(1)
      {
        if(task_file_regis_valid(hpccard))
        {
          if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT))
          {
            if(pccard_read_status_reg(hpccard) == DRQ_BIT)
            {
              return FALSE;
            }
            else
            {
              sector_address += 1;
              Count += 1;

              if (Count == sector_count)
              {
                break;
              }

              if (Count <= (sector_count / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector)
                if (Count % hpccard->cf.cf_addr.sector_count == 0)
                {
                  break;
                }
            }
          }
          else if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
          {
            return FALSE;
          }
        }
      }
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}

/**
  * @brief  write verify 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to the data buffer.
  * @param  sector_address: the sector addr 
  * @param  sector_count: the sector count 
  * @retval true or false.
  */
BOOL pccard_write_verify(pccard_handle_type *hpccard, uint8_t *pbuffer, uint32_t sector_address, uint32_t sector_count)
{
  uint16_t Count = 0;
  uint8_t  Reg;

  if(sector_count == 0)
  {
    sector_count = 256;
  }

  while(Count < sector_count)
  {
    // Set the parameters to write a sector //
    translate_chsaddr(hpccard, sector_address, Count, sector_count);
    Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
    *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

    if(cf_send_command(hpccard, ATA_WRITE_VERIFY_CMD))
    {
      while(1)
      {
        if(task_file_regis_valid(hpccard))
        {
          if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
          {
            write_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);

            sector_address += 1;
            Count += 1;

            if (Count == sector_count)
            {
              break;
            }

            if (Count <= (sector_count / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector)
              if (Count % hpccard->cf.cf_addr.sector_count == 0)
              {
                break;
              }
          }
          else if (pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
          {
            return FALSE;
          }
        }
      }
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT))
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}

/**
  * @brief  set multiple mode 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_count: the sector count 
  * @retval true or false.
  */
BOOL pccard_set_multiple_mode(pccard_handle_type *hpccard, uint32_t sector_count)
{
  hpccard->cf.cf_addr.sector_count = sector_count;

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(!cf_send_command(hpccard, ATA_SET_MULTIPLE_MODE_CMD))
  {
    return FALSE;
  }

  return TRUE;
}

/**
  * @brief  set features 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_count: the sector count 
  * @param  feature: feature val
  * @retval true or false.
  */
BOOL pccard_set_features(pccard_handle_type *hpccard, uint32_t sector_count, uint8_t Feature)
{
  hpccard->cf.cf_addr.sector_count = sector_count;

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_FEATURE_REG)   = Feature;

  if(!cf_send_command(hpccard, ATA_SET_FEATURE_CMD))
  {
    return FALSE;
  }

  return TRUE;
}

/**
  * @brief  read buffer 
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to the data buffer.
  * @retval true or false.
  */
BOOL pccard_read_buffer(pccard_handle_type *hpccard, uint8_t *pbuffer)
{
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = hpccard->cf.cf_addr.drv;

  if(cf_send_command(hpccard, ATA_READ_BUFFER_CMD))
  {
    if (task_file_regis_valid(hpccard))
    {
      if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
      {
        read_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);
      }
      else if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
      {
        return FALSE;
      }
    }
  }

  while(1)
  {
    if(task_file_regis_valid(hpccard))
    {
      if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
      {
        break;
      }
      else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        return FALSE;
      }
    }
  }

