ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
            if (Count <= (sector_count / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector)
              if (Count % hpccard->cf.cf_addr.sector_count == 0)
              {
                break;
              }
          }
          else if (pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
          {
            return FALSE;
          }
        }
      }
    }

    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT))
        {
          break;
        }
        else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}

/**
  * @brief  read long sector
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_address: the sector addr 
  * @param  pbuffer: pointer to the data buffer.
  * @retval true or false.
  */
BOOL pccard_read_long_sector(pccard_handle_type *hpccard, uint32_t sector_address, uint8_t *pbuffer)
{
  uint32_t index = 0, Total_Cylinder;
  uint8_t Reg;
  BOOL command_vaild = TRUE;

  Total_Cylinder = (uint32_t)(hpccard->cf.cfcard_info.default_head * hpccard->cf.cfcard_info.default_sector);

  hpccard->cf.cf_addr.cylinder  = (uint16_t)(sector_address / Total_Cylinder);
  hpccard->cf.cf_addr.head      = (uint8_t)((sector_address % Total_Cylinder) / hpccard->cf.cfcard_info.default_sector);
  hpccard->cf.cf_addr.sector    = (uint8_t)((sector_address % Total_Cylinder) % hpccard->cf.cfcard_info.default_sector) + 1;
  hpccard->cf.cf_addr.sector_count = 1;

  Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

  if(cf_send_command(hpccard, ATA_READ_LONG_SECTOR_CMD))
  {
    if(task_file_regis_valid(hpccard))
    {
      if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
      {
        read_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);

        if(pccard_read_status_reg(hpccard) & DRQ_BIT)
        {
          for(index = 0; index < 4; index++)
          {
            *(uint8_t *)pbuffer++ = *(uint8_t *)(hpccard->cf.io_addr);
          }
        }
        else
        {
          command_vaild = FALSE;
        }

        if(pccard_read_status_reg(hpccard) & DRQ_BIT)
        {
          command_vaild = FALSE;
        }

        else if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
        {
          return FALSE;

        }
      }
    }
  }

  while(1)
  {
    if(task_file_regis_valid(hpccard))
    {
      if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
      {
        break;
      }
      else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        return FALSE;
      }
    }
  }

  if(command_vaild == TRUE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  write long sector
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_address: the sector addr 
  * @param  pbuffer: pointer to the data buffer.
  * @retval true or false.
  */
BOOL pccard_write_long_sector(pccard_handle_type *hpccard, uint32_t sector_address, uint8_t *pbuffer)
{
  uint32_t index = 0, Total_Cylinder;
  uint8_t Reg;
  BOOL command_vaild = TRUE;

  Total_Cylinder = (uint32_t)(hpccard->cf.cfcard_info.default_head * hpccard->cf.cfcard_info.default_sector);

  hpccard->cf.cf_addr.cylinder  = (uint16_t)(sector_address / Total_Cylinder);
  hpccard->cf.cf_addr.head      = (uint8_t)((sector_address % Total_Cylinder) / hpccard->cf.cfcard_info.default_sector);
  hpccard->cf.cf_addr.sector    = (uint8_t)((sector_address % Total_Cylinder) % hpccard->cf.cfcard_info.default_sector) + 1;
  hpccard->cf.cf_addr.sector_count = 1; 

  Reg = hpccard->cf.cf_addr.head | hpccard->cf.cf_addr.drv | 0xA0;

  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder >> 8);
  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->cf.cf_addr.cylinder);
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_SECTOR_NUMBER) = hpccard->cf.cf_addr.sector;
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_sector_count)  = hpccard->cf.cf_addr.sector_count;
  *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_CARD_HEAD)     = Reg;

  if(cf_send_command(hpccard, ATA_WRITE_LONG_SECTOR_CMD))
  {
    if(task_file_regis_valid(hpccard))
    {
      if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
      {
        write_sector(hpccard, pbuffer, PCCARD_SECTOR_SIZE);

        if(pccard_read_status_reg(hpccard) & DRQ_BIT)
        {
          for(index = 0; index < 4; index++)
          {
            *(uint8_t *)(hpccard->cf.io_addr) = *(uint8_t *)pbuffer++;
          }
        }
        else
        {
          command_vaild = FALSE;
        }

        if(pccard_read_status_reg(hpccard) & DRQ_BIT)
        {
          command_vaild = FALSE;
        }

        else if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
        {
          return FALSE;
        }
      }
    }
  }

  while(1)
  {
    if(task_file_regis_valid(hpccard))
    {
      if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT))
      {
        break;
      }
      else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        return FALSE;
      }
    }
  }

  if(command_vaild == TRUE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  read sector
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to the data buffer.
  * @param  transfer_size: the data length.
  * @retval pointer to the data buffer after read.
  */
uint8_t *read_sector(pccard_handle_type *hpccard, uint8_t *pbuffer, uint32_t transfer_size)
{
  uint32_t index = 0;

