ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  xmc_enable_16bit_feature(hpccard->instance, &(hpccard->init), hpccard->cf.enable_8_bit_mode);

  if(hpccard->cf.dma_enable == TRUE)
  {
    if(hpccard->cf.enable_8_bit_mode)
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)hpccard->cf.io_addr, (uint32_t)pbuffer, transfer_size, READ_TRANSFER, ENABLE_8_BIT_TRANSFER);
    }
    else
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)hpccard->cf.io_addr, (uint32_t)pbuffer, (transfer_size / 2), READ_TRANSFER, ENABLE_16_BIT_TRANSFER);
    }

    while(1)
    {
      if(dma_flag_get(DMA1_FDT1_FLAG) != RESET)
      {
        dma_flag_clear(DMA1_FDT1_FLAG);
        break;
      }
    }

    pbuffer += 512;
  }
  else
  {
    if(hpccard->cf.enable_8_bit_mode)
    {
      for(; index < (transfer_size) ; index++)
      {
        *(uint8_t *)pbuffer++ = *(uint8_t *)(hpccard->cf.io_addr);
      }
    }
    else
    {
      for(; index < (transfer_size / 2); index++)
      {
        *(uint16_t *)pbuffer = *(uint16_t *)(hpccard->cf.io_addr);
       /* offset to next 16 bit */
        pbuffer += 2;  
      }
    }
  }

  xmc_enable_16bit_feature(hpccard->instance, &(hpccard->init), 1);
  return pbuffer;
}

/**
  * @brief  write sector
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  pbuffer: pointer to the data buffer.
  * @param  transfer_size: the data length.
  * @retval pointer to the data buffer after write.
  */
uint8_t *write_sector(pccard_handle_type *hpccard, uint8_t *pbuffer, uint32_t transfer_size)
{
  uint32_t index = 0;

  xmc_enable_16bit_feature(hpccard->instance, &(hpccard->init), hpccard->cf.enable_8_bit_mode);

  if(hpccard->cf.dma_enable == TRUE)
  {
    if(hpccard->cf.enable_8_bit_mode)
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)pbuffer, (uint32_t)hpccard->cf.io_addr, transfer_size, WRITE_TRANSFER, ENABLE_8_BIT_TRANSFER);
    }
    else
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)pbuffer, (uint32_t)hpccard->cf.io_addr, (transfer_size / 2), WRITE_TRANSFER, ENABLE_16_BIT_TRANSFER);
    }

    while(1)
    {
      if(dma_flag_get(DMA1_FDT1_FLAG) != RESET)  
      {
        dma_flag_clear(DMA1_FDT1_FLAG);
        break;
      }
    }

    pbuffer += 512;
  }
  else
  {
    if(hpccard->cf.enable_8_bit_mode)
    {
      for(; index < (transfer_size); index++)
      {
        *(uint8_t *)(hpccard->cf.io_addr) = *(uint8_t *)pbuffer++;
      }
    }
    else
    {
      for(; index < (transfer_size / 2); index++)
      {
        *(uint16_t *)(hpccard->cf.io_addr) = *(uint16_t *)pbuffer;
        /* offset to next 16 bit */
        pbuffer += 2;  // offset to next 16 bit
      }
    }
  }

  xmc_enable_16bit_feature(hpccard->instance, &(hpccard->init), 1);
  return pbuffer;
}

/**
  * @brief  reset the pccard memory
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval status
  */
BOOL pccard_reset(pccard_handle_type *hpccard)
{
  /* provide an sw reset and read and verify the:
   - cf configuration option register at address 0x98000200 --> 0x80
   - card configuration and status register at address 0x98000202 --> 0x00
   - pin replacement register  at address 0x98000204 --> 0x0c
   - socket and copy register at address 0x98000206 --> 0x00
  */

  uint8_t config_option_reg;

  /* set up the reset bit in config option register */
  *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG) = 0x80;
  delay_ms(100);
  /* clear the reset bit in config option register */
  *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG) = 0x00;
  delay_ms(100);
  /* set the pc card i/o configurations */
  *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG) = hpccard->cf.protocol;
  delay_ms(100);

  config_option_reg = *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG);

  if(config_option_reg == hpccard->cf.protocol)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * translate_chsaddr:
  *  translate disk sector number to c.h.s address.
  *  input  : cfcard
  *        start (start sector number)
  *        sector_count (sector count which read from cf card)
  *        sector_limit (maximum sector number)
  *  output  : none
  */
void translate_chsaddr(pccard_handle_type *hpccard, uint32_t Start, uint16_t sector_count, uint16_t Sector_Limit)
{
  uint32_t Total_Cylinder;
  uint16_t Prev_Count;

  Prev_Count = (Sector_Limit / hpccard->cf.cfcard_info.default_sector) * hpccard->cf.cfcard_info.default_sector;

  Total_Cylinder = (uint32_t)(hpccard->cf.cfcard_info.default_head * hpccard->cf.cfcard_info.default_sector); // The total sectors in one cylinder

  hpccard->cf.cf_addr.cylinder  = (uint16_t)(Start / Total_Cylinder);
  hpccard->cf.cf_addr.head      = (uint8_t)((Start % Total_Cylinder) / hpccard->cf.cfcard_info.default_sector);
  hpccard->cf.cf_addr.sector    = (uint8_t)((Start % Total_Cylinder) % hpccard->cf.cfcard_info.default_sector) + 1;

  if ((Prev_Count <= sector_count) && (sector_count <= Sector_Limit))
  {
    hpccard->cf.cf_addr.sector_count = (uint8_t)(Sector_Limit % hpccard->cf.cfcard_info.default_sector);
  }
  else
  {
    hpccard->cf.cf_addr.sector_count = (uint8_t)hpccard->cf.cfcard_info.default_sector;
  }
}

/**
  * @brief  read cis information.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL read_cfcard_cis_information(pccard_handle_type *hpccard)
{
  uint8_t CIS_1, CIS_2, CIS_3;

  CIS_1 = *(uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | 0x0);
  CIS_2 = *(uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | 0x2);
  CIS_3 = *(uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | 0x4);

  if(CIS_1 == 0x1 && CIS_2 == 0x4 && CIS_3 == 0xdf)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  send command.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  cmd: the command value
  * @retval true or false.
  */
BOOL cf_send_command(pccard_handle_type *hpccard, uint8_t Cmd)
{
  uint8_t Reg;

  do
  {
    *(__IO uint8_t  *)(hpccard->cf.io_addr | ATA_STATUS_CMD) = Cmd;

    while(!task_file_regis_valid(hpccard)) ;

    Reg = pccard_read_status_reg(hpccard);

    if ((Reg & ERR_BIT) != 0)
    {
      return FALSE;
    }
  }
  while((Reg & RDY_BIT) == 0);

