ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  return TRUE;
}

/**
  * @brief  check the pccard taskfilereg valid.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval true or false.
  */
BOOL task_file_regis_valid(pccard_handle_type *hpccard)
{
  uint8_t status = 0;

  status = pccard_read_status_reg(hpccard);

  if(status & BUSY_BIT)
  {
    return FALSE;
  }

  return TRUE;
}

/**
  * @brief  check the pccard info valid.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @param  sector_count: sector count
  * @param  head_count:head count
  * @retval true or false.
  */
BOOL vaild_init_drive_para(pccard_handle_type *hpccard, uint16_t sector_count, uint8_t head_count)
{
  uint8_t CardInfo[PCCARD_SECTOR_SIZE * sizeof(uint8_t)] = {0};

  memset(CardInfo, 0, PCCARD_SECTOR_SIZE * sizeof(uint8_t));

  if(pccard_identify(hpccard))
  {
    while(1)
    {
      if(task_file_regis_valid(hpccard))
      {
        if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
        {
          read_sector(hpccard, CardInfo, PCCARD_SECTOR_SIZE);
          break;
        }
        else if(pccard_read_status_reg(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
        {
          printf("\r\nCommand Pass, but ERR bit is high");
          printf("\r\nCF Status Reg=%#x", pccard_read_status_reg(hpccard));
          printf("\r\nCF Error  Reg=%#x", pccard_read_error_reg(hpccard));
          return FALSE;
        }
      }
    }
  }

  while(1)
  {
    if(task_file_regis_valid(hpccard))
    {
      if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
      {
        break;
      }
      else if((pccard_read_status_reg(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        printf("\r\nSend Command Failed");
        printf("\r\nCF Status Reg=%#x", pccard_read_status_reg(hpccard));
        printf("\r\nCF Error  Reg=%#x", pccard_read_error_reg(hpccard));
        return FALSE;
      }
    }
  }

  if (((uint16_t)CardInfo[0] | (uint16_t)CardInfo[1] << 8) == 0x848A && ((uint16_t)CardInfo[110] | \
      (uint16_t)CardInfo[111] << 8) ==  head_count && ((uint16_t)CardInfo[112] | (uint16_t)CardInfo[113] << 8) ==  sector_count )
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }

}

/**
  * @brief  printf the verification result.
  * @param  result: pointer to a verification_result structure that contains
  *                various kinds of verification.
  * @retval none.
  */
void show_verification_result(verification_result_struct *result)
{
  printf("\r\n");
  printf("\r\n----------------------------------------------------------------------");
  printf("\r\n%s    %-6s   ", "ATTRIBUTE_RW_PASS      ", ((result->attribute_rw_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "READ_ATTRIBUTE_CIS     ", ((result->cis_read_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "IDENTIFY_DRIVE         ", ((result->ata_identify_drive_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "EXECUTE_DRIVE_DIAG     ", ((result->ata_execute_drive_diag_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "write_sector           ", ((result->ata_write_sector_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "read_sector            ", ((result->ata_read_sector_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "ACESS_25_SECTORS       ", ((result->acess_25_sectors_pass) ? " PASS" : "FAILED *****"));
  printf("\r\n----------------------------------------------------------------------");
  printf("\r\n\r\n");
}


/**
  * @brief  this function handles pccard device interrupt request.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval status
  */
void pccard_irqhandler(pccard_handle_type *hpccard)
{
}


/**
  * @brief  return the pccard controller state
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval state
  */
pccard_state_type pccard_get_state(pccard_handle_type *hpccard)
{
  return hpccard->state;
}

/**
  * @brief  get the pccard error reg value.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval reg: error reg value.
  */
uint8_t pccard_read_error_reg(pccard_handle_type *hpccard)
{
  uint8_t Reg = 0;

  /* read error reg operation */
  Reg =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_ERROR_REG);
  CF_print(ERR_REG_INFO, ("\r\nCF card ERROR Register value is %#x", Reg));
  return Reg;
}

/**
  * @brief  get the pccard status reg value.
  * @param  hpccard: pointer to a pccard_handle_type structure that contains
  *                the configuration information for pccard module.
  * @retval reg: status reg value.
  */
uint8_t pccard_read_status_reg(pccard_handle_type *hpccard)
{
  uint8_t Reg = 0;

  /* read status reg operation */
  Reg =  *(__IO uint8_t *)(hpccard->cf.io_addr | ATA_STATUS_CMD);
  CF_print(STS_REG_INFO, ("\r\nCF card STATUS Register value is %#x", Reg));

  return Reg;
}
/**
  * @}
  */

/**
  * @}
  */












